{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"Identity_20:0": {"name": "Identity_20:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_14:0": {"name": "Identity_14:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_18:0": {"name": "Identity_18:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_9:0": {"name": "Identity_9:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_13:0": {"name": "Identity_13:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_10:0": {"name": "Identity_10:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_11:0": {"name": "Identity_11:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_19:0": {"name": "Identity_19:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_12:0": {"name": "Identity_12:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_5:0": {"name": "Identity_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_16:0": {"name": "Identity_16:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_4:0": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_17:0": {"name": "Identity_17:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_15:0": {"name": "Identity_15:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_6:0": {"name": "Identity_6:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_7:0": {"name": "Identity_7:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "Identity_8:0": {"name": "Identity_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/Arched_Eyebrows/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Arched_Eyebrows/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Bags_Under_Eyes/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Bags_Under_Eyes/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Mouth_Slightly_Open/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Mouth_Slightly_Open/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Mustache/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Mustache/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Narrow_Eyes/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Narrow_Eyes/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Rosy_Cheeks/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Rosy_Cheeks/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Smiling/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Smiling/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Straight_Hair/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Straight_Hair/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Wavy_Hair/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Wavy_Hair/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Wearing_Earrings/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Wearing_Earrings/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Wearing_Hat/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Wearing_Hat/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Wearing_Lipstick/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Wearing_Lipstick/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Bangs/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Bangs/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Wearing_Necklace/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Wearing_Necklace/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Black_Hair/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Black_Hair/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Blond_Hair/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Blond_Hair/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Brown_Hair/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Brown_Hair/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Eyeglasses/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Eyeglasses/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Gray_Hair/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Gray_Hair/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/Heavy_Makeup/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Heavy_Makeup/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9216"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/High_Cheekbones/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/High_Cheekbones/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/conv2d/Relu"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/max_pooling2d/MaxPool", "StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/conv2d_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/model/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/conv2d_2/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/conv2d_3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/model/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/flatten/Reshape", "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/Wearing_Necklace/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Wearing_Necklace/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Wearing_Necklace/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/Heavy_Makeup/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Heavy_Makeup/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Heavy_Makeup/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/Black_Hair/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Black_Hair/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Black_Hair/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Blond_Hair/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Blond_Hair/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Blond_Hair/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/model/Arched_Eyebrows/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Arched_Eyebrows/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Arched_Eyebrows/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Bags_Under_Eyes/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Bags_Under_Eyes/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Bags_Under_Eyes/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/Brown_Hair/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Brown_Hair/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Brown_Hair/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/Mouth_Slightly_Open/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Mouth_Slightly_Open/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Mouth_Slightly_Open/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/Mustache/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Mustache/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Mustache/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Narrow_Eyes/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Narrow_Eyes/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Narrow_Eyes/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/Rosy_Cheeks/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Rosy_Cheeks/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Rosy_Cheeks/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Eyeglasses/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Eyeglasses/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Eyeglasses/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Smiling/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Smiling/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Smiling/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Straight_Hair/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Straight_Hair/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Straight_Hair/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/Wavy_Hair/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Wavy_Hair/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Wavy_Hair/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/High_Cheekbones/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/High_Cheekbones/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/High_Cheekbones/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Wearing_Earrings/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Wearing_Earrings/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Wearing_Earrings/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Gray_Hair/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Gray_Hair/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Gray_Hair/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/Wearing_Hat/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Wearing_Hat/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Wearing_Hat/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Wearing_Lipstick/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Wearing_Lipstick/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Wearing_Lipstick/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/Bangs/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu", "StatefulPartitionedCall/model/Bangs/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/Bangs/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/Wearing_Necklace/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Wearing_Necklace/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Heavy_Makeup/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Heavy_Makeup/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Black_Hair/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Black_Hair/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Blond_Hair/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Blond_Hair/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Arched_Eyebrows/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Arched_Eyebrows/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Bags_Under_Eyes/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Bags_Under_Eyes/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Brown_Hair/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Brown_Hair/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Mouth_Slightly_Open/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Mouth_Slightly_Open/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Mustache/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Mustache/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Narrow_Eyes/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Narrow_Eyes/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Rosy_Cheeks/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Rosy_Cheeks/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Eyeglasses/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Eyeglasses/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Smiling/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Smiling/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Straight_Hair/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Straight_Hair/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Wavy_Hair/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Wavy_Hair/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/High_Cheekbones/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/High_Cheekbones/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Wearing_Earrings/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Wearing_Earrings/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Gray_Hair/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Gray_Hair/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Wearing_Hat/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Wearing_Hat/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Wearing_Lipstick/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Wearing_Lipstick/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/Bangs/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/Bangs/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_20", "op": "Identity", "input": ["StatefulPartitionedCall/model/Wearing_Necklace/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_8", "op": "Identity", "input": ["StatefulPartitionedCall/model/Heavy_Makeup/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_3", "op": "Identity", "input": ["StatefulPartitionedCall/model/Black_Hair/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_4", "op": "Identity", "input": ["StatefulPartitionedCall/model/Blond_Hair/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/Arched_Eyebrows/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model/Bags_Under_Eyes/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_5", "op": "Identity", "input": ["StatefulPartitionedCall/model/Brown_Hair/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_10", "op": "Identity", "input": ["StatefulPartitionedCall/model/Mouth_Slightly_Open/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_11", "op": "Identity", "input": ["StatefulPartitionedCall/model/Mustache/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_12", "op": "Identity", "input": ["StatefulPartitionedCall/model/Narrow_Eyes/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_13", "op": "Identity", "input": ["StatefulPartitionedCall/model/Rosy_Cheeks/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_6", "op": "Identity", "input": ["StatefulPartitionedCall/model/Eyeglasses/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_14", "op": "Identity", "input": ["StatefulPartitionedCall/model/Smiling/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_15", "op": "Identity", "input": ["StatefulPartitionedCall/model/Straight_Hair/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_16", "op": "Identity", "input": ["StatefulPartitionedCall/model/Wavy_Hair/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_9", "op": "Identity", "input": ["StatefulPartitionedCall/model/High_Cheekbones/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_17", "op": "Identity", "input": ["StatefulPartitionedCall/model/Wearing_Earrings/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_7", "op": "Identity", "input": ["StatefulPartitionedCall/model/Gray_Hair/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_18", "op": "Identity", "input": ["StatefulPartitionedCall/model/Wearing_Hat/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_19", "op": "Identity", "input": ["StatefulPartitionedCall/model/Wearing_Lipstick/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/model/Bangs/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/model/Arched_Eyebrows/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Arched_Eyebrows/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Bags_Under_Eyes/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Bags_Under_Eyes/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Mouth_Slightly_Open/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Mouth_Slightly_Open/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Mustache/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Mustache/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Narrow_Eyes/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Narrow_Eyes/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Rosy_Cheeks/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Rosy_Cheeks/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Smiling/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Smiling/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Straight_Hair/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Straight_Hair/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wavy_Hair/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wavy_Hair/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wearing_Earrings/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wearing_Earrings/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wearing_Hat/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wearing_Hat/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wearing_Lipstick/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wearing_Lipstick/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Bangs/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Bangs/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wearing_Necklace/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Wearing_Necklace/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Black_Hair/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Black_Hair/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Blond_Hair/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Blond_Hair/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Brown_Hair/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Brown_Hair/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Eyeglasses/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Eyeglasses/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Gray_Hair/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Gray_Hair/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Heavy_Makeup/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/Heavy_Makeup/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "shape": [9216, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/High_Cheekbones/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/High_Cheekbones/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}